---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureDefinitionId
source: html/654ca37e-f0cb-a365-b5be-575d18973729.htm
---
# FailureDefinitionId Methods

Compares two Guid-based enum object based on their concrete class and GUID value.